[
    {
        "id": "spare-shooting",
        "title": "Why Spare Shooting Deserves More Attention",
        "date": "March 31, 2025",
        "author": "Jeff Rice - USBC Silver Level Coach",
        "image": "/assets/img/five_seven_split.jpg",
        "alt": "Bowler picking up a spare",
        "content": "<p>As a high school bowling coach, one of the most important—and often overlooked—skills I emphasize with my athletes is spare shooting. I've even dedicated entire practices to it. The challenge? Spares just don't carry the same thrill as throwing strike after strike. But if you want to be a better bowler, consistently converting spares is one of the fastest ways to level up your game.</p><p>Here's why I focus so much on it:</p><h3 class=\"mt-4 mb-3\">Small Changes, Big Impact</h3><p>Closing just one more frame per game can boost your score by up to 20 pins. Over the course of a series, that can mean a 10–15 pin improvement to your average. That kind of bump adds up quickly and can make a huge difference in tight matches.</p><h3 class=\"mt-4 mb-3\">Spares Build Better Bowlers</h3><p>Practicing spares sharpens key fundamentals like targeting, lane adjustments, and visualization. You might not be focused on hitting a perfect breakpoint or tracking ball motion through the pin deck, but you <em>do</em> need to think critically about your angles and make purposeful adjustments—especially when dealing with multi-pin leaves. That includes tough splits like the Big Four (4-6-7-10), the 7-10 split, or the Greek Church (4-6-7-9-10). In those cases, the goal isn't necessarily to convert the spare—though it's great if you do—but to maximize pin count. Getting two or three pins is always better than walking away with an open frame.</p><p>Spare shooting forces you to use the whole lane and think critically about your execution. As <em>Bowler's Journal</em> puts it, \"Making various spares requires throwing the ball toward all sections of the pindeck... being able to visually assess where the ball is on the lane is a very important asset\" (<em>Spare Shooting: A Master Class</em>, March 2025, p. 24).</p><h3 class=\"mt-4 mb-3\">Even the Pros Rely on Spares</h3><p>In the same article, the <em>Journal</em> highlights how critical spare shooting is—even at the highest levels. During the PBA's 2025 Delaware Classic, several players averaged over 240 per game, yet avoiding open frames still proved to be a major factor in their success. Strikes might light up the scoreboard, but it's spare conversions that hold your game together.</p><h3 class=\"mt-4 mb-3\">Finding What Works</h3><p>There are many schools of thought when it comes to spare shooting: use a plastic ball, try urethane, or even learn a backup shot (though I don't recommend the last one—long-term wrist health matters). My rule of thumb? Use whatever method you can repeat safely and consistently. But no matter what you choose, there's no shortcut: you have to put in the practice.</p><p>Norm Duke—one of my all-time favorite bowlers—didn't use a spare ball. He had mastered his release so well that he could pick up spares with his strike ball. And while I doubt he perfected that overnight (Norm, if you did, my apologies), it took serious work to develop that level of control and consistency.</p><h3 class=\"mt-4 mb-3\">My Approach</h3><p>Personally, I go with a plastic ball. For me, it simplifies things—I don't want to factor in lane transitions or ball motion variables more than I have to. I know my target, I know the shot I want to make, and if I execute properly, I trust the spare will fall. Some might call it lazy—I call it repeatable.</p><p>One day at practice, I was lining up for a 10-pin and turned around immediately after my release because I <em>knew</em> it was good. My bowlers stared at me like I was crazy, but I told them: with enough practice, you'll know when you've thrown a good ball. That kind of confidence only comes from reps.</p><h3 class=\"mt-4 mb-3\">Why It Matters</h3><p>Let's face it—most of us aren't bowling 300 games every time out. For the average league bowler, the odds of a perfect game are around 1 in 11,500. So unless perfection is your norm, you <em>have</em> to be able to pick up spares. That's where consistency lives. That's where games are won—or lost.</p><p>It's an old saying, but it holds true: <strong>Strikes win games, spares win championships.</strong></p>",
        "tags": [
            "#SpareShootingTips",
            "#BowlingFundamentals",
            "#CoachingAdvice"
        ],
        "isFeatured": true,
        "readTime": "5 min",
        "views": "120 views"
    },
    {
        "id": "rolling-through-indiana",
        "title": "Rolling Through Indiana: Milestones and Memories",
        "date": "November 14, 2024",
        "author": "Jeff Rice - USBC Silver Level Coach",
        "image": "/assets/img/AddysonEarnedPlaques.jpg",
        "alt": "Featured image",
        "content": "<p>One of the greatest joys in my coaching and personal life has been watching my daughter, Addyson, grow up immersed in the world of bowling. From her earliest days on the lanes with bumpers to the impressive accomplishments she's earned as a young competitor, her journey has been full of memories that remind me why I love this sport—and why I'm committed to sharing it with others.</p><p>Addyson has earned her place in the bowling community. She's a two-time Sectional Champion for high school girls, a two-time Jr. Gold qualifier, KYSTS plastic ball champion, and an all-city team honoree for the past two years. Now, as the captain of her high school team, she leads others with the same determination and love for the game that I've seen in her from the start. But beyond the titles and trophies, it's the moments we've shared on the road and at the lanes that have defined her journey.</p><p>We've traveled all over Indiana for tournaments, with some stops in Kentucky, each trip an adventure filled with excitement, preparation, and that unique anticipation only a bowling tournament can bring. These journeys have given us opportunities to explore new places and face different competitors, adding a layer of experience that's been invaluable in her development.</p><p>One trip, however, stands out more than most. We traveled to Elkhart, Indiana, for a grueling eliminator-style tournament. The format was demanding: six games to start, with cuts after every round—six games, then four, then two, all the way to a final step-ladder for the top four. Addyson bowled her heart out, advancing through every cut, but by the later rounds, the fatigue was visible. She'd glance at me between frames with a look that said, I'm ready for this to be over. But each time, they'd call the names for the next round, and there she was, still in the running.</p><p>She pushed through that day, finishing in an impressive third place. Although it's not an experience she likes to revisit, it's a testament to her resilience. She and her friend, who was also competing, joked afterward that they'd experienced a \"mental breakdown\" together due to the exhaustion—a bonding moment that sealed their friendship. That day may have been physically and mentally challenging, but it's one of those stories we look back on with a mix of pride and humor.</p><p>These experiences have been more than milestones in her competitive journey; they've been powerful moments in our relationship and in her growth as an athlete. I'm proud of her accomplishments, but even more, I'm proud of her determination, her willingness to push through tough days, and her love for the sport.</p><p>As her high school coach for the past three years, I feel privileged to be part of her journey and to see how far she's come. Each tournament, each road trip, and each frame she bowls are memories I'll cherish. It's my hope that her journey inspires other young bowlers to embrace the sport with the same passion and resilience that she brings to the lanes.</p>",
        "tags": [
            "#BowlingJourney",
            "#BowlingMemories",
            "#SportsParenting"
        ],
        "isFeatured": false,
        "readTime": "4 min",
        "views": "150 views"
    },
    {
        "id": "beyond-the-approach",
        "title": "Beyond the Approach: Why I Coach Youth Bowling",
        "date": "May 16, 2025",
        "author": "Jeff Rice - USBC Silver Level Coach",
        "image": "/assets/img/teamKnuckles.jpg",
        "alt": "Youth bowlers with coach",
        "content": "<p class=\"lead\"><em>A reflection on the growth, community, and quiet power of youth bowling</em></p><p>I started bowling when I was 13 years old. Back then, it was just something I loved to do—me, the lanes, and the satisfying crash of pins. I never imagined that decades later, I'd be standing behind those same lanes, not as a player, but as a coach—guiding kids through a sport that has given me so much.</p><p>For the past six years, I've had the privilege of coaching middle school bowlers, and for the last four, high school athletes as well. Each season brings a new group of kids, a new set of challenges, and new stories I'll carry with me for a lifetime. Every year I've coached middle school, at least one individual—or a full team—has advanced to the state finals. But it's not the titles or trophies that make me proud. It's watching a kid light up after picking up their first spare. It's the quiet high-fives between teammates after a tough frame. It's the look of determination when they line up their shot, knowing they've put in the work.</p><h3 class=\"mt-4 mb-3\">Finding Their Footing</h3><p>Middle school bowling is where most of these kids start to figure out who they are. Some walk in with confidence; many don't. But little by little, they find their footing. They learn to trust their swing, their team, and—most importantly—themselves. It's more than form and follow-through. It's character development in motion.</p><p>High school bowling adds layers. The skill level rises, the stakes are higher, and suddenly it's not just about bowling—it's about leadership, communication, and resilience. Practices turn into strategy sessions. Matches feel like battles. And yet, the core remains the same: growth.</p><h3 class=\"mt-4 mb-3\">A Personal Journey</h3><p>One of the most personal parts of this journey has been watching my own daughter grow through the sport. She started out shy—soft-spoken, hesitant. But bowling gave her something to belong to. Through seasons of ups and downs, she found her voice. She found her people. And she eventually became captain of her high school team. I've seen her lead, support, and lift up others in ways that only this sport—and the community around it—could have nurtured.</p><p>Bowling is often misunderstood—seen as a casual activity rather than a serious sport. But spend a little time around these young athletes, and that perception changes quickly. You'll see discipline, heart, perseverance, and a whole lot of teamwork.</p><h3 class=\"mt-4 mb-3\">Beyond the Score</h3><p>If you've never been to a high school bowling match, I encourage you to check one out. Keep an eye out for the next local competition, walk in with an open mind, and soak in the experience. You'll hear the cheers, feel the energy, and witness the kind of camaraderie that doesn't show up on a scoreboard.</p><p>What makes bowling so special is that sense of community. You'll see opposing teams bowling side-by-side—competing, yes—but also cheering each other on. Sharing laughs, encouraging great shots, lifting each other up in tough frames. It's a culture of respect, support, and connection that's hard to find in other sports.</p><p>Bowling creates a family, not just a team. And once you're part of that family, it sticks with you.</p><p>I coach because bowling changed my life. And now, I get to help it do the same for others.</p>",
        "tags": [
            "#YouthBowling",
            "#BowlingCoach",
            "#SportsParenting",
            "#CoachingMatters",
            "#SupportYouthSport"
        ],
        "isFeatured": false,
        "readTime": "4 min",
        "views": "0 views"
    },
    {
        "id": "stop-searching-for-quick-fixes",
        "title": "Stop Searching for Quick Fixes - Start Seeking Real Coaching",
        "date": "October 7, 2025",
        "author": "Jeff Rice - USBC Silver Level Coach",
        "image": "/assets/img/coachingMoment.jpg",
        "alt": "Coaching Moment",
        "content": "<p class=\"lead\"><em>Stop Searching for Quick Fixes — Start Seeking Real Coaching</em></p><p>The other day, I was scrolling through Reddit threads about bowling — something I like to do every now and then to see what questions bowlers are asking. There were some genuinely good questions out there from people who truly wanted to get better. But what caught my attention (and honestly, frustrated me a little) were the answers.</p><p>A lot of the responses were things like:</p><ul><li><em>“Try to throw a hook.”</em></li><li><em>“You should go two-handed.”</em></li><li><em>“Buy this ball.”</em></li><li><em>“Just bowl more tournaments.”</em></li></ul><p>Now, don’t get me wrong — there’s nothing <em>wrong</em> with some of those ideas in the right context. If you’ve been bowling for a while and you’re looking to expand your experience, entering tournaments can be great. But for someone who’s still learning to line up properly, hit their target, or repeat a shot? Those quick tips can actually make things more confusing, not less.</p><h2 id=\"crowdsourced-coaching\">The Problem with “Crowdsourced Coaching”</h2><p>Bowling communities online are full of passionate people, but passion doesn’t always equal good advice. What I see too often are bowlers trying to help other bowlers — but without understanding the “why” behind the game. A new bowler doesn’t need to know how to throw a bigger hook; they need to learn how to build a repeatable shot. They don’t need to spend $250 on the newest ball; they need to understand how to make their current ball work for them.</p><p>It’s like trying to learn how to play guitar by asking Reddit what kind of strings you should buy — you might get some good answers, but none of it helps if you don’t yet know how to form a chord.</p><h2 id=\"why-coach-matters\">Why Finding a Coach Matters</h2><p>As a <strong>USBC Silver Level Coach</strong>, I’ve worked with bowlers of all skill levels — from brand-new youth bowlers to seasoned high school athletes. What I’ve seen time and again is that progress happens fastest when a bowler has someone who can meet them where they are.</p><p>A coach helps you understand <em>why</em> your ball hooks too early, <em>why</em> you miss your target, or <em>why</em> your release feels inconsistent. And more importantly, a good coach helps you find the small, practical steps to fix those things — not just throw a bigger hook or switch hands.</p><p>You don’t have to commit to a long-term coaching plan or spend hours every week working with someone. But even one or two sessions with a qualified coach can completely change how you understand your game. It’s the difference between trying random fixes versus actually learning how to bowl better.</p><h2 id=\"quick-vs-true\">Quick Answers vs. True Improvement</h2><p>I get it — everyone wants quick improvement. But real progress in bowling (just like in life) doesn’t come from shortcuts. It comes from learning, practicing with purpose, and having someone in your corner who knows how to guide you through the process.</p><p>So the next time you find yourself scrolling through online advice or wondering what ball to buy, consider finding a coach instead. Whether it’s a one-time session or a recurring partnership, a coach can help you see what you can’t see on your own — and that’s where true growth starts.</p><hr><h3 id=\"cta\">Ready to Take the Next Step?</h3><p>If you’re serious about improving your game and want guidance that’s tailored to <strong>you</strong>, I’d love to help. Whether you’re just starting out or looking to fine-tune your approach, I offer individualized coaching sessions designed to meet bowlers where they are — no gimmicks, no shortcuts, just honest instruction focused on progress.</p><p>You can <a href=\"/pages/contact.html\" rel=\"noopener\">contact me here</a> or visit the <a href=\"/pages/contact.html\" rel=\"noopener\">Coaching</a> page on my site to schedule a session or ask questions.</p><p><a class=\"btn btn--primary\" href=\"/pages/contact.html\" aria-label=\"Schedule a coaching session with Jeff Rice\">Schedule a Coaching Session</a></p>",
        "tags": [
            "#BowlingCoach",
            "#BowlingAdvice",
            "#CoachingMatters"
        ],
        "isFeatured": false,
        "readTime": "4 min",
        "views": "0 views"
    },
    {
"id": "five-essential-bowling-drills",
"title": "Five Essential Bowling Drills for Building Consistency and Confidence",
"date": "October 27, 2025",
"author": "Jeff Rice - USBC Silver Level Coach",
"image": "/assets/img/bowlingLaneArrows.jpg",
"alt": "Bowler practicing at the foul line during a training session",
"content": "<p>Real improvement comes from focused repetition. These five drills are simple, repeatable, and effective for bowlers of all levels. Use them to build balance, timing, lane awareness, and confidence under pressure.</p><hr><h3>1) The 1-Step Drill</h3><p><strong>Purpose:</strong> Timing, leverage, and a stable finish position.</p><p><strong>How:</strong> Start one step behind your normal slide. Hold the ball as if the pushaway has already happened. Take a smooth slide to the line and release.</p><p><strong>Focus:</strong> Head still, eyes on target, slide and swing in sync, hold your finish until the ball hits the pins.</p><p><em>Coach note:</em> Great for bowlers who rush. It builds patience and feel at the line.</p><hr><h3>2) The Release (Foul-Line) Drill</h3><p><strong>Purpose:</strong> Clean, consistent release and roll pattern.</p><p><strong>How:</strong> Stand at the foul line in your finished slide position. Let the ball swing freely and roll it just past the line with a soft landing.</p><p><strong>Focus:</strong> Hand <em>behind and through</em> the ball, quiet ball drop, stable finish. Consider slow-motion video for feedback.</p><hr><h3>3) Spare Shooting Circuit</h3><p><strong>Purpose:</strong> Accuracy and frame control.</p><p><strong>How:</strong> Pick five common spares (e.g., 10, 7, 3–6–10, 2–4–5, 1–2–4–7). Roll 2–3 shots at each and track make percentage.</p><p><strong>Focus:</strong> Consistent targeting and speed. Use a spare ball when possible. Build a system (3–6–9 or 2–4–6) and stick to it.</p><p><em>Coach note:</em> Spares win matches. Treat them like free throws—calm, repeatable, unemotional.</p><hr><h3>4) Strike-From-Every-Arrow</h3><p><strong>Purpose:</strong> Versatility and lane play awareness.</p><p><strong>How:</strong> Attempt a strike starting at the first arrow, then move one arrow left after each shot. Adjust speed, loft, rotation, and laydown to create the right shape.</p><p><strong>Focus:</strong> Reading ball motion changes as angles shift. Note which arrows and shapes best match your release and equipment.</p><p><em>Coach note:</em> Not for everyone, but incredibly educational. It expands your toolbox for transition and different patterns.</p><hr><h3>5) Balance Line Hold</h3><p><strong>Purpose:</strong> Finish stability and posture.</p><p><strong>How:</strong> Without a ball, take your approach and <em>hold</em> your finish for three seconds. Add a ball and repeat with slow, controlled shots.</p><p><strong>Focus:</strong> Shoulders level, knee flex, head still, pressure centered over the slide foot. Finish tall—don’t fall off the shot.</p><hr><h3>Putting It Together</h3><p>Spend 10–15 minutes on drills before full approaches. Track a couple of simple metrics (spare make %, soft landings, finish holds). Over time you’ll see cleaner releases, steadier balance, and better shot repeatability.</p><p>Want a personalized practice plan or video review? <a href="/pages/contact.html">Contact me</a> and we’ll dial in what <em>you</em> need most.</p>",
"tags": [
"#bowlingdrills",
"#practice",
"#fundamentals",
"#lanepaly",
"#spares"
],
"isFeatured": true,
"readTime": "6 min",
"views": "0 views"
}
]
